### DATA DRIVER: POPULATING TO THE DB

This notebook contains the code to connect and populate the DB of our project. In order to do this, we use a python environment suited with `numpy`, `pandas`, the official `mysql.connector` driver and the commonly used `mysqlalchemy` package.

At first, we begin importing everything:

In [2]:
import pandas as pd
import numpy as np
import mysql.connector

We should first focus on getting the DB connection using only code. We can do it with this piece, using the proper project configuration options as listed by `project_options` dict:

In [33]:
# Official mysql.connector for python
project_options = {
    'user': 'manager', 
    'host' : 'localhost',
    'password' : 'managerpassword', 
    'database' : 'Proyecto_BBDD' 
}

connection = mysql.connector.connect(**project_options)
cursor = connection.cursor()

Next cell should be ran whenever we terminate the session or a DB operation. If not, the mysql server connection will still be opened indifinitely until we kill the parent process.

In [69]:
# WHEN TERMINATED, EXECUTE THIS CELL
connection.close()

Now, what we'd like to do is to populate the DB Tables using the data available throught the whole analysis. We will mainly use two data sources:

1. The Infojobs data under the [infojobs_data.csv]("../oferta_analysis/infojobs_data.csv") file, obtained by pure scrapping of their portal and posteriory cleaned and analysed in the ["analisis de la Oferta"]("../oferta_analysis/data_analysis.ipynb") notebook. Its data will be dumped on the CLIENT_ACCOUNT, ADDRESS, COMPANY_PROFILE and JOB_OFFER tables. 

2. The statistical data extracted from the INE tables listed on top of the ["analisis de la Demanda"]("../demanda_analysis/analysis.ipynb") in that same notebook, contained in the [user_statistics.csv]("./user_statistics.csv"). Using the proportions of graduated people depending on its sex and education modality, we will create a mockup population for the DB users, according to the empirical distribution shown in that table.

We will start by filling up the tables related to the job offer data.

#### DB TABLES RELATED TO OFFERS

In [105]:
df = pd.read_csv("../oferta_analysis/infojobs_data.csv", index_col="id")
df.head()

,title,company,description,status,location,modality,release_date,agreement,work_time,salary,education,category
id,,,,,,,,,,,,
1,Auditor / Controller Interno,Sector Retail,Controller interno de procesos de gestión Audi...,True,Ourense,Presencial,2022-05-14,Contrato indefinido,Jornada completa,30500.0,Grado,Administración de empresas
2,Assistant Business Manager,GRUPO GIRO,Grupo Giró es referente mundial en el envasado...,True,Badalona,Híbrido,2022-05-09,Contrato indefinido,Jornada completa,NaN,Grado,Administración de empresas
3,FINANCE MANAGER,Fed Finance,"Desde Fed Finance, consultoría líder en headhu...",True,Madrid,Híbrido,2022-05-14,Contrato indefinido,Jornada completa,55000.0,Grado,Administración de empresas
4,Project Administrator - Técnico de Gestión I+D,IMDEA Networks,IMDEA Networks es un instituto de investigació...,True,Leganés,Híbrido,2022-05-14,Contrato de duración determinada,Jornada completa,25500.0,Grado,Administración de empresas
5,Becario/a administrativo/a,"NEW LINE EVENTS, S.L.",¿Eres una persona con capacidad de comunicació...,True,Madrid,Híbrido,2022-05-14,Contrato formativo,Jornada intensiva - indiferente,NaN,Grado,Administración de empresas

**ADDRESS TABLE**

In [40]:
# INSERT STATEMENT and data to be inserted
insert_address = "INSERT INTO `ADDRESS` (`address_id`, `city`, `country`, `zip_code`) VALUES (" + "%s," *(3) + "%s)"
unique_locations = df['location'].unique()

# SELECT STATEMENT
cursor.execute('SELECT * FROM ADDRESS')
result = set([i[1] for i in cursor.fetchall()])

# Insert DataFrame records one by one, if not present
for i, location in enumerate(unique_locations):
    if location not in result:
        cursor.execute(insert_address, (i, location, 'España', 0))

In [64]:
connection.commit()

**CLIENT_ACCOUNT TABLE**

In [65]:
# Compute unique company identifiers
unique_company_names = {}

for index, company in df['company'].iteritems():
    if company not in unique_company_names:
        unique_company_names[company] = "company_" + str(index)

assert len(unique_company_names) == len(df['company'].unique())

In [63]:
# Then, all companies as clients in CLIENT_ACCOUNT:

# INSERT STATEMENT and data to be inserted
insert_address = '''
    INSERT INTO `CLIENT_ACCOUNT` (`username`, `password`, `date_joined`, `email_notifications_active`)
    VALUES (%s,%s,%s,%s)
'''

# SELECT STATEMENT
cursor.execute('SELECT username FROM CLIENT_ACCOUNT')
result = set([i[0] for i in cursor.fetchall()])

# Insert DataFrame records one by one, if not present
for i, username in enumerate(unique_company_names.values()):
    if username not in result:
        cursor.execute(insert_address, (username, "1234", '2022-01-01', 0))

**COMPANY_PROFILE TABLE**

In [83]:
# From location to address_id
cursor.execute('SELECT address_id, city FROM ADDRESS')
location_address_id = {city : address_id for address_id, city in cursor.fetchall()}

In [101]:
# Retrieve the unique row companies to INSERT using the CLIENT_ACCOUNT table
# and append the ADDRESS id based on the previous mapping 

company_columns = {
    'company_id' : [],      # company index of the dataframe
    'company_name' : [],    # company column of the dataframe
    'creation_date' : [],   # same date as CLIENT_ACCOUNT.date_joined
    'address_id' : [],      # FK of the ADDRESS table
    'user_account_id' : []  # FK of the CLIENT_ACCOUNT
}

cursor.execute('''SELECT user_account_id, username, date_joined FROM CLIENT_ACCOUNT''')
for client_account_id, username, date in cursor.fetchall():
    company_columns['company_id'].append(int(username.split("company_")[1]))
    company_columns['user_account_id'].append(client_account_id)
    company_columns['creation_date'].append(str(date.date()))

#company_columns['company_id'] = pd.Series(company_columns['company_id'])
company_columns['company_name'] = list(df.loc[company_columns['company_id'], 'company'])
#company_columns['creation_date'] = pd.Series(company_columns['creation_date'])
company_columns['address_id'] = pd.Series(df.loc[company_columns['company_id'], 'location'])
company_columns['address_id'] = list(company_columns['address_id'].apply(lambda loc: location_address_id[loc]))
#company_columns['user_account_id'] = pd.Series(company_columns['user_account_id'])

In [104]:
# COMPANY INSERT STATEMENT
insert_company =  '''  
    INSERT INTO COMPANY_PROFILE (`company_id`, `company_name`, `creation_date`, `address_id`, `user_account_id`)
    VALUES (%s, %s, %s, %s, %s)
'''

for i, row in pd.DataFrame(company_columns).iterrows():
    #print(tuple(row))
    cursor.execute(insert_company, tuple(row))

connection.commit()

**JOB_OFFER TABLE**

In [178]:
cursor.execute('SELECT company_id, company_name FROM COMPANY_PROFILE')
company_name_id = {company_name : company_id for company_id, company_name in cursor.fetchall()}

In [183]:
# Dataframe preparation before dumping
df.index.name = "job_offer_id"
df['company_id'] = df['company'].apply(lambda name: company_name_id[name])
df['description'] = df['description'].apply(lambda description: description[ : min(1000, len(description))] )
df.loc[df['release_date'].isnull(), 'release_date'] = df.iloc[0]['release_date']
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41179 entries, 1 to 41179
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         41179 non-null  object
 1   company       41179 non-null  object
 2   description   41179 non-null  object
 3   status        41179 non-null  bool
 4   location      41179 non-null  object
 5   modality      36884 non-null  object
 6   release_date  41179 non-null  object
 7   agreement     41179 non-null  object
 8   work_time     41179 non-null  object
 9   salary        17702 non-null  float64
 10  education     41179 non-null  object
 11  category      41179 non-null  object
 12  company_id    41179 non-null  int64
dtypes: bool(1), float64(1), int64(1), object(10)
memory usage: 4.1+ MB

In [186]:
# Finally, dump the whole dataFrame in the JOB_OFFER Table
# Better to use sqlalchemy to avoid conflicts with nan values

from sqlalchemy import create_engine

engine = create_engine('mysql+mysqlconnector://manager:managerpassword@localhost:3306/Proyecto_BBDD', echo = False)
df.to_sql(name = 'JOB_OFFER', con = engine, if_exists = 'append', index = True)

41179

#### USER RELATED DB TABLES

In [17]:
df_stats = pd.read_csv("user_statistics.csv")
df_stats

,Educacion,Modalidad,Sexo,Situación laboral en 2019,Total,Porcentaje
0,Bachillerato,Ciencias / Ciencia y Tecnología,Hombres,Trabajando,30381,0.044779
1,Bachillerato,Ciencias / Ciencia y Tecnología,Hombres,En desempleo,7209,0.010625
2,Bachillerato,Ciencias / Ciencia y Tecnología,Hombres,Inactivo,19872,0.029290
3,Bachillerato,Humanidades y Ciencias Sociales,Hombres,Trabajando,23205,0.034202
4,Bachillerato,Humanidades y Ciencias Sociales,Hombres,En desempleo,7417,0.010932
...,...,...,...,...,...,...
325,Universidad,10 - SERVICIOS,Hombres,En desenpleo,314,0.000463
326,Universidad,10 - SERVICIOS,Hombres,Inactivo,315,0.000464
327,Universidad,10 - SERVICIOS,Mujeres,Trabajando,2776,0.004092
328,Universidad,10 - SERVICIOS,Mujeres,En desenpleo,335,0.000494
329,Universidad,10 - SERVICIOS,Mujeres,Inactivo,242,0.000357

Let's first create the mockup population, using the proportions listed behind the `Porcentaje` column of the dataframe:

In [23]:
population_length = 2000

np.random.seed(0)
resampled_index = np.random.choice(df_stats.index, population_length, p = df_stats['Porcentaje'])

my_users = df_stats.loc[resampled_index, ['Educacion', 'Modalidad', 'Sexo', 'Situación laboral en 2019']].copy()
my_users.reset_index(inplace = True)
my_users.rename(columns = {"index" : "user_stats"}, inplace = True)
my_users.head()

,user_stats,Educacion,Modalidad,Sexo,Situación laboral en 2019
0,187,Ciclo Superior,21 - ADMINISTRACIÓN Y GESTIÓN,Hombres,En desempleo
1,275,Universidad,01 - EDUCACIÓN,Mujeres,Inactivo
2,252,Ciclo Superior,21 - ADMINISTRACIÓN Y GESTIÓN,Mujeres,Trabajando
3,186,Ciclo Superior,21 - ADMINISTRACIÓN Y GESTIÓN,Hombres,Trabajando
4,72,Ciclo Medio,12 - TRANSPORTE Y MANTENIMIENTO DE VEHÍCULOS,Hombres,Trabajando

**CLIENT_ACCOUNT**

In [24]:
df_client_account = pd.DataFrame()
df_client_account['username'] = my_users.index.to_series().apply(lambda x: "user_" + str(x)).values
df_client_account['password'] = "1234"
df_client_account['date_joined'] = "2013-01-01"
#df_client_account['phone_no'] = None
df_client_account['email_notifications_active'] = False

df_client_account.head()

  username password date_joined  email_notifications_active
0   user_0     1234  2013-01-01                       False
1   user_1     1234  2013-01-01                       False
2   user_2     1234  2013-01-01                       False
3   user_3     1234  2013-01-01                       False
4   user_4     1234  2013-01-01                       False

In [25]:
#
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://manager:managerpassword@localhost:3306/Proyecto_BBDD', echo = False)
df_client_account.to_sql(name = 'CLIENT_ACCOUNT', con = engine, if_exists = 'append', index = False)

2000

**USER_PROFILE**

In order to fill the User Profile Table, we should be aware of two things: 

> The INE table labels and the database column names are not the same

To deal with this, we will create some `dicts` as translators. They will be used only once to fill the database.

> We should distribute our generated population across Spain. How to do it?

We can use the `spain_offers_general` csv created when analizing the offers. This little table lists all the 52 spain provinces repeated so far in the offers table. Then, we will use its distribution to generate our user addresses. Is this in accordance with the cientific method? Not really, but it's much better than using an uniform distribution.

In [57]:
# 1. Dicts to translate between INE table labels and our database column names
names_dict = {"Hombres": "Bob Dylan", "Mujeres" : "Ada Lovelace"}
working_dict = {'Trabajando' : "WORKING", "En desempleo" : "SEARCHING", "En desenpleo" : "SEARCHING", "Inactivo" : "UNKNOWN"}
gender_dict = {'Hombres' : "MAN", "Mujeres" : "WOMAN"}

In [61]:
# 2. Use the spain_provinces distribution to get the user addresses. 

spain_provinces = pd.read_csv("../oferta_analysis/spain_offers_general.csv")
spain_provinces.head()

user_addresses = np.random.choice(spain_provinces['province'], population_length, p = spain_provinces['counts'] / spain_provinces['counts'].sum())
print(user_addresses[:20])
print(len(user_addresses))

['Girona' 'Madrid' 'Barcelona' 'Illes Balears' 'A Coruña' 'Cádiz'
 'Barcelona' 'Sevilla' 'Madrid' 'Alicante' 'Madrid' 'Barcelona' 'Madrid'
 'Murcia' 'León' 'Madrid' 'Madrid' 'Madrid' 'Madrid' 'Barcelona']
2000

In [66]:
# We have to connect to the DB and obtain for each address its ID key
cursor.execute('SELECT address_id, city FROM ADDRESS')
address_name_id = {city : address_id for address_id, city in cursor.fetchall() }
user_addresses_ids = pd.Series(user_addresses).map(address_name_id)
user_addresses_ids.fillna(8, inplace = True) # Barcelona rules
user_addresses_ids.info()

<class 'pandas.core.series.Series'>
RangeIndex: 2000 entries, 0 to 1999
Series name: None
Non-Null Count  Dtype
--------------  -----
2000 non-null   float64
dtypes: float64(1)
memory usage: 15.8 KB

In [49]:
# Also, to know the USER_PROFILE FK's, we connect back to the previous filled table CLIENT_ACCOUNT
cursor.execute('SELECT user_account_id, username FROM CLIENT_ACCOUNT')
address_name_id = {username : user_account_id for user_account_id, username in cursor.fetchall() }
users_clients_fk = df_client_account['username'].map(address_name_id)
users_clients_fk.head()

0    17712
1    17713
2    17714
3    17715
4    17716
Name: username, dtype: int64

In [67]:
# Create the DF of Users to insert to USER_PROFILE

df_user_profile = pd.DataFrame()
df_user_profile['profile_id'] = my_users.index.values
df_user_profile['first_name'] = my_users['Sexo'].apply(lambda x: names_dict[x].split(" ")[0])
df_user_profile['last_name'] = my_users['Sexo'].apply(lambda x: names_dict[x].split(" ")[1])
df_user_profile['profile_type'] = my_users['Situación laboral en 2019'].apply(lambda x: working_dict[x])
df_user_profile['gender'] = my_users['Sexo'].apply(lambda x: gender_dict[x])
df_user_profile['address_id'] = user_addresses_ids.values
df_user_profile['user_account_id'] = users_clients_fk.values

df_user_profile.head()

,profile_id,first_name,last_name,profile_type,gender,address_id,user_account_id
0,0,Bob,Dylan,SEARCHING,MAN,43.0,17712
1,1,Ada,Lovelace,UNKNOWN,WOMAN,2.0,17713
2,2,Ada,Lovelace,WORKING,WOMAN,8.0,17714
3,3,Bob,Dylan,WORKING,MAN,8.0,17715
4,4,Bob,Dylan,WORKING,MAN,104.0,17716

In [68]:
# Finally, we connect to the DB to fill the USER_PROFILE table

engine = create_engine('mysql+mysqlconnector://manager:managerpassword@localhost:3306/Proyecto_BBDD', echo = False)
df_user_profile.to_sql(name = 'USER_PROFILE', con = engine, if_exists = 'append', index = False)

2000

**EDUCATION**

In [74]:
# Create the DF of User education profiles to insert to EDUCATION

df_education = pd.DataFrame()
df_education['education_id'] = my_users.index.values
df_education['education_type'] = my_users['Educacion']
df_education['title'] = my_users['Modalidad']
df_education['date_start'] = "2013-01-01"
df_education['date_ending'] = "2014-01-01"
df_education['profile_id'] = my_users.index.values

df_education.head()

,education_id,education_type,title,date_start,date_ending,profile_id
0,0,Ciclo Superior,21 - ADMINISTRACIÓN Y GESTIÓN,2013-01-01,2014-01-01,0
1,1,Universidad,01 - EDUCACIÓN,2013-01-01,2014-01-01,1
2,2,Ciclo Superior,21 - ADMINISTRACIÓN Y GESTIÓN,2013-01-01,2014-01-01,2
3,3,Ciclo Superior,21 - ADMINISTRACIÓN Y GESTIÓN,2013-01-01,2014-01-01,3
4,4,Ciclo Medio,12 - TRANSPORTE Y MANTENIMIENTO DE VEHÍCULOS,2013-01-01,2014-01-01,4

In [77]:
# Filling the EDUCATION DB Table
engine = create_engine('mysql+mysqlconnector://manager:managerpassword@localhost:3306/Proyecto_BBDD', echo = False)
df_education.to_sql(name = 'EDUCATION', con = engine, if_exists = 'append', index = False)

2000

**EXPERIENCE**

In [86]:
# Link between the education title and the activity group of the CNAE 2009 clasification 

dict_modality_experience = {

    # Bachillerato too general
    "Ciencias / Ciencia y Tecnología" : None,
    "Humanidades y Ciencias Sociales" : None,
    "Artes" : None,

    # Ciclo Medio y superior
    '21 - ADMINISTRACIÓN Y GESTIÓN' : "K",
    '12 - TRANSPORTE Y MANTENIMIENTO DE VEHÍCULOS' : "H",
    '23 - SERVICIOS SOCIOCULTURALES Y A LA COMUNIDAD' : "N",
    '20 - INFORMÁTICA Y COMUNICACIONES' : "J",
    '06 - SANIDAD' : "Q",
    '19 - IMAGEN Y SONIDO' : "J",
    '25 - ACTIVIDADES FÍSICAS Y DEPORTIVAS' : "R",
    '22 - COMERCIO Y MARKETING' : "G",
    '10 - ELECTRICIDAD Y ELECTRÓNICA' : "C",
    '05 - IMAGEN PERSONAL' : "S",
    '03 - INDUSTRIAS ALIMENTARIAS' : "C",
    '24 - HOSTELERÍA Y TURISMO' : "I",
    '07 - SEGURIDAD Y MEDIO AMBIENTE': "O",
    '08 - FABRICACIÓN MECÁNICA' : "C",
    '18 - ARTES GRÁFICAS' : "C",
    '01 - AGRARIA' : "A",
    '02 - MARÍTIMO-PESQUERA' : "A",
    '11 - ENERGÍA Y AGUA' : "D",
    '09 - INSTALACIÓN Y MANTENIMIENTO' : "C",
    '14 - EDIFICACIÓN Y OBRA CIVIL' : "F",
    '14 - EDIFICACIÓN Y OBRA CIVIL 15 - VIDRIO Y CERÁMICA 17 - TEXTIL, CONFECCIÓN Y PIEL' : "C",
    '04 - QUÍMICA' : "C",
    '15 - VIDRIO Y CERÁMICA 16 - MADERA, MUEBLE Y CORCHO 17 - TEXTIL, CONFECCIÓN Y PIEL 26 - ARTES Y ARTESANÍAS' : "C",

    # Universidad
    '01 - EDUCACIÓN' : "P",
    '02 - ARTES Y HUMANIDADES' : "R",
    '03 - CIENCIAS SOCIALES, PERIODISMO Y DOCUMENTACIÓN' : "J",
    '04 - NEGOCIOS, ADMINISTRACIÓN Y DERECHO' : "O",
    '05 - CIENCIAS' : "M",
    '06 - INFORMÁTICA' : "J",
    '07 - INGENIERÍA, INDUSTRIA Y CONSTRUCCIÓN' : "O",
    '08 - AGRICULTURA, GANADERÍA, SILVICULTURA, PESCA Y VETERINARIA':"C",
    '09 - SALUD Y SERVICIOS SOCIALES' : "Q",
    '10 - SERVICIOS' : "S",

}

In [89]:
# Create the DF of Users to insert to USER_PROFILE

my_working_users = my_users.loc[my_users['Situación laboral en 2019'] == "Trabajando"]

df_experience = pd.DataFrame()
df_experience['experience_id'] = my_working_users.index.values
df_experience['experience_type'] = "RELATED"
df_experience['title'] = my_working_users['Modalidad'].map(dict_modality_experience)
df_experience['description'] = "2013-01-01"
df_experience['date_start'] = "2019-01-01"
df_experience['company_name'] = "Not specified"
df_experience['profile_id'] = my_working_users.index.values

df_experience.head(30)

,experience_id,experience_type,title,description,date_start,company_name,profile_id
0,2,RELATED,NaN,2013-01-01,2019-01-01,Not specified,2
1,3,RELATED,NaN,2013-01-01,2019-01-01,Not specified,3
2,4,RELATED,K,2013-01-01,2019-01-01,Not specified,4
3,6,RELATED,K,2013-01-01,2019-01-01,Not specified,6
4,7,RELATED,H,2013-01-01,2019-01-01,Not specified,7
5,8,RELATED,NaN,2013-01-01,2019-01-01,Not specified,8
6,9,RELATED,J,2013-01-01,2019-01-01,Not specified,9
7,10,RELATED,O,2013-01-01,2019-01-01,Not specified,10
8,11,RELATED,Q,2013-01-01,2019-01-01,Not specified,11
9,13,RELATED,Q,2013-01-01,2019-01-01,Not specified,13
10,15,RELATED,O,2013-01-01,2019-01-01,Not specified,15
11,16,RELATED,J,2013-01-01,2019-01-01,Not specified,16
12,17,RELATED,NaN,2013-01-01,2019-01-01,Not specified,17
13,18,RELATED,O,2013-01-01,2019-01-01,Not specified,18
14,19,RELATED,NaN,2013-01-01,2019-01-01,Not specified,19
15,20,RELATED,None,2013-01-01,2019-01-01,Not specified,20
16,21,RELATED,None,2013-01-01,2019-01-01,Not specified,21
17,22,RELATED,O,2013-01-01,2019-01-01,Not specified,22
18,23,RELATED,O,2013-01-01,2019-01-01,Not specified,23
19,24,RELATED,J,2013-01-01,2019-01-01,Not specified,24
20,25,RELATED,Q,2013-01-01,2019-01-01,Not specified,25
21,27,RELATED,O,2013-01-01,2019-01-01,Not specified,27
22,28,RELATED,G,2013-01-01,2019-01-01,Not specified,28
23,30,RELATED,O,2013-01-01,2019-01-01,Not specified,30
24,31,RELATED,None,2013-01-01,2019-01-01,Not specified,31
25,34,RELATED,N,2013-01-01,2019-01-01,Not specified,34
26,36,RELATED,NaN,2013-01-01,2019-01-01,Not specified,36
27,38,RELATED,Q,2013-01-01,2019-01-01,Not specified,38
28,39,RELATED,H,2013-01-01,2019-01-01,Not specified,39
29,41,RELATED,NaN,2013-01-01,2019-01-01,Not specified,41

In [90]:
engine = create_engine('mysql+mysqlconnector://manager:managerpassword@localhost:3306/Proyecto_BBDD', echo = False)
df_experience.to_sql(name = 'EXPERIENCE', con = engine, if_exists = 'append', index = False)

1443